docs/research.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bruno Cuconato</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/site.css"/><link rel="icon" type="image/x-icon" href="/static/favicon.ico"/></head>
<body>
<header id="top" class="status">
<div class="nav">
  <ul id="navlinks" class="horizontal-list">
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/blog/index.html">Blog</a>
    </li>
    <li>
      <a href="/about.html">About</a>
    </li>
  </ul>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Bruno Cuconato</h1>
</header><a href="#publications" style="font-style:italic;font-size:0.8em;">[skip to publications]​</a>

<p>
I am currently a PhD student/candidate/researcher at the computer
science department at <a href="https://en.wikipedia.org/wiki/Pontifical_Catholic_University_of_Rio_de_Janeiro">PUC-Rio</a>, under the supervision of <a href="https://www-di.inf.puc-rio.br/~hermann/">Edward Hermann
Haeusler</a>.
</p>

<p>
I mostly work on the Graph Logical Framework, a <a href="https://en.wikipedia.org/wiki/Logical_framework">logical framework</a> with
a simple meta-language intended to facilitate the implementation and
use (see the <a href="https://glf.tecmf.inf.puc-rio.br/">web interface</a>) of deductive systems. This is in
opposition to most logical frameworks (or proof assistants, as they
like to be called) these days, whose focus lies more in the
verification of the systems&rsquo; properties.
</p>

<p>
Previously I have worked with natural language processing, with a
focus in developing datasets (under the guidance of <a href="https://arademaker.github.io/">Alexandre
Rademaker</a>). For my master&rsquo;s thesis, I have developed a <a href="./blog/gf-grammars.html">digital grammar
for Portuguese</a> under the Grammatical Framework formalism.
</p>

<p>
You can find my contact information in any of the papers below.
</p>

<section id="outline-container-publications" class="outline-2">
<h2 id="publications">Publications</h2>
<div class="outline-text-2" id="text-publications">
<ul class="org-ul">
<li>Haeusler, E.H., <i>Bruno Cuconato</i>, Luiz A. Glatzl, Maria L.
Guateque, Diogo M. Vieira, Elvismary M. de Armas, Fernanda Baião,
Marcos Catanho, Antonio B. de Miranda &amp; Sergio Lifschitz.
<b>Intentional Semantics for Molecular Biology</b> (BSB 2023, full
paper). In: Reis, M.S., de Melo-Minardi, R.C. (eds) Advances in
Bioinformatics and Computational Biology. BSB 2023. Lecture Notes
in Computer Science(), vol 13954. Springer, Cham.
<a href="https://doi.org/10.1007/978-3-031-42715-2_9">https://doi.org/10.1007/978-3-031-42715-2_9</a></li>
<li><i>Bruno Cuconato</i>, Jefferson de Barros Santos, Edward Hermann
Haeusler. <b>A graph logical framework</b> (EBL XX 2022, presentation-only)</li>
<li><i>Bruno Cuconato</i>, Jefferson de Barros Santos, Edward Hermann
Haeusler. <b>A logical framework with a graph meta-language</b> (LFMTP
2021, presentation-only)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cuconato2021-logical-framework-lfmtp.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cuconato2021-logical-framework-lfmtp.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li><i>Bruno Cuconato Claro</i>. <b>A computational grammar for
Portuguese</b>. MSc Thesis at EMAp/FGV, advised by Alexandre
Rademaker (2019)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cuconato2019-computational-grammar-fgv.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cuconato2019-computational-grammar-fgv.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li>Alexandre Rademaker, <i>Bruno Cuconato</i>, Alessandra Cid, Alexandre
Tessarollo, Henrique Muniz. <b>Completing the Princeton Annotated
Gloss Corpus Project</b> (GWC 2019)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/rademaker2019-glosstag-gwc.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/rademaker2019-glosstag-gwc.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li>Leonel Figueiredo de Alencar, <i>Bruno Cuconato</i>, Alexandre
Rademaker. <b>MorphoBR: An Open Source Large-Coverage Full-Form
Lexicon for Morphological Analysis of Portuguese</b> (Texto
Livre 2018) <span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/alencar2018-morphobr-textolivre.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/alencar2018-morphobr-textolivre.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li><i>Bruno Cuconato</i>, Alexandre Rademaker. <b>A computational grammar
for Portuguese</b> (PROPOR 2018, demo)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cuconato2018-grammar-propor.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cuconato2018-grammar-propor.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li>Alexandre Rademaker, Fabricio Chalub, <i>Bruno Cuconato</i>, Henrique
Muniz, Guilherme Passos. <b>CL-CONLLU Universal Dependencies in
Common Lisp</b>. (PROPOR 2018, demo)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/rademaker2018-conllu-propor.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/rademaker2018-conllu-propor.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li>Suemi Higuchi, Cláudia Freitas, <i>Bruno Cuconato</i> and Alexandre
Rademaker. <b>Text Mining for History: first steps on building a
large dataset</b> (LREC 2018)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/higuchi2018-dhbb-lrec.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/higuchi2018-dhbb-lrec.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li>Alessandra Cid, Alexandre Rademaker, <i>Bruno Cuconato</i>, Valeria de
Paiva. <b>Linguistic Legal Concept Extraction in Portuguese</b>
(JURIX 2018) <span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cid2018-legal-concept-jurix.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/cid2018-legal-concept-jurix.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li>Pedro Delfino, <i>Bruno Cuconato</i>, Guilherme Paulino Passos, Gerson
Zaverucha, Alexandre Rademaker. <b>Using OpenWordnet-PT for Question
Answering on Legal Domain</b> (GWC 2018)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/delfino2018-oab-gwc.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/delfino2018-oab-gwc.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
<li>Pedro Delfino, <i>Bruno Cuconato</i>, Edward Hermann Haeusler,
Alexandre Rademaker. <b>Passing the Brazilian OAB Exam: Data
Preparation and Some Experiments</b> (JURIX 2017)
<span class="publication-links">   <a href="https://www.inf.puc-rio.br/~bclaro/publications/delfino2017-oab-jurix.bib" target="_blank" type="text/plain">.bib</a>   <a href="https://www.inf.puc-rio.br/~bclaro/publications/delfino2017-oab-jurix.pdf" target="_blank" type="application/pdf">.pdf</a> </span></li>
</ul>
</div>
</section>
</main>
</body>
</html>